app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "tier1", "tier2", "tier3", "tier4", "tier5", "tier6", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save!